In [36]:
import pandas as pd
df = pd.read_csv('titanic1.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [37]:
df
dir(df)
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [38]:
print(df.columns)

Index(['PassengerId', 'Name', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [39]:
df.drop(['PassengerId','Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [40]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [41]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [42]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [43]:
inputs.drop('Sex', axis = 'columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [44]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [45]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [46]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [58]:
from sklearn.model_selection import train_test_split
X_train,X_test, y_train, y_test = train_test_split(inputs, target, test_size = 0.2)

In [59]:
len(X_train)

712

In [60]:
len(X_test)

179

In [61]:
len(inputs)

891

In [62]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [63]:
model.fit(X_train, y_train)

GaussianNB()

In [64]:
model.score(X_test, y_test)

0.7821229050279329

In [65]:
X_test[:10]

     Pclass        Age      Fare  female  male
609       1  40.000000  153.4625       1     0
500       3  17.000000    8.6625       0     1
746       3  16.000000   20.2500       0     1
830       3  15.000000   14.4542       1     0
732       2  29.699118    0.0000       0     1
670       2  40.000000   39.0000       1     0
266       3  16.000000   39.6875       0     1
754       2  48.000000   65.0000       1     0
441       3  20.000000    9.5000       0     1
666       2  25.000000   13.0000       0     1

In [66]:
y_test[:10]

609    1
500    0
746    0
830    1
732    0
670    1
266    0
754    1
441    0
666    0
Name: Survived, dtype: int64

In [67]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 0, 1, 0, 1, 0, 0], dtype=int64)

In [68]:
model.predict_proba(X_test[:10])

array([[1.38634484e-05, 9.99986137e-01],
       [9.87029746e-01, 1.29702537e-02],
       [9.86617486e-01, 1.33825138e-02],
       [4.20422851e-02, 9.57957715e-01],
       [9.75782120e-01, 2.42178795e-02],
       [2.22730339e-02, 9.77726966e-01],
       [9.83583610e-01, 1.64163902e-02],
       [1.19103854e-02, 9.88089615e-01],
       [9.87888549e-01, 1.21114511e-02],
       [9.75482177e-01, 2.45178229e-02]])